app/controllers/events_controller.rb

INSERT INTO "events" ("name", "start_time", "end_time", "created_at", "updated_at", "user_id", "priority") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @event = Current.user.events.build(event_params)

    if @event.save