app/controllers/main_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def index
        if session[:user_id]
            @user = User.find_by(id: session[:user_id])