app/controllers/passwords_controller.rb

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "[FILTERED]"], ["updated_at", "2024-03-29 17:40:08.492219"], ["id", 8]]
---
    def update
        if Current.user.update(password_params)